/*************************************************************
编写时间：2020-12-3
程序版本：V1.0
开发者：王昆

程序功能：实现输出指定字符的三角形
输入数据：用户键盘随机输入任意2个数据
输出结果：屏幕显示字符三角形
****************************************************************/

/*引用头文件*/
#include <iostream>
#include <string>
using namespace std;

/*主函数定义*/
int main()
{
    int n; //三角形行数
    string poin; //组成三角形的字符
    cout << "输入两个字符，第一个为三角形行数，第二个为组成三角形的字符";
    cin >> n >> poin;
    for (int i = 1; i <= n; i++)
    {
        for (int j = 1; j <= n - i; j++)//根据行数输出空格
        {
            cout << " ";
        }
        for (int k = 1; k <= 2 * i - 1; k++)//输出字符
        {
            cout << poin;
        }
        cout << endl;
    }
    return 1;
}